In [2]:
import pandas as pd 
df = pd.read_csv('C:\\Users\\91863\\Desktop\\ML\\data\\salaries.csv')

In [4]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [6]:
inputs = df.drop('salary_more_then_100k', axis = 'columns')
target = df['salary_more_then_100k']
inputs

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [7]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [10]:
from sklearn.preprocessing import LabelEncoder
lecomp = LabelEncoder()
lejob = LabelEncoder()
ledegree = LabelEncoder()

In [11]:
inputs['company_'] = lecomp.fit_transform(inputs['company'])
inputs['job_'] = lejob.fit_transform(inputs['job'])
inputs['degree_'] = ledegree.fit_transform(inputs['degree'])

In [13]:
inputs.head()

  company                  job     degree  company_  job_  degree_
0  google      sales executive  bachelors         2     2        0
1  google      sales executive    masters         2     2        1
2  google     business manager  bachelors         2     0        0
3  google     business manager    masters         2     0        1
4  google  computer programmer  bachelors         2     1        0

In [15]:
final_df = inputs.drop(['company', 'job', 'degree'], axis = 'columns')
final_df.head()

   company_  job_  degree_
0         2     2        0
1         2     2        1
2         2     0        0
3         2     0        1
4         2     1        0

In [16]:
from sklearn import tree

In [17]:
clf = tree.DecisionTreeClassifier()
clf.fit(final_df, target)

DecisionTreeClassifier()

In [18]:
clf.score(final_df, target)

1.0

In [19]:
clf.predict([[2,2,1]])

array([0], dtype=int64)

In [20]:
import pickle

In [21]:
with open('salaries', 'wb') as f:
    pickle.dump(clf, f)

In [22]:
with open('salaries', 'rb') as f:
    sp = pickle.load(f)

In [23]:
sp.predict([[2,2,1]])

array([0], dtype=int64)